[LANG]
language=Ukrainian (Україна)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Помилка синтаксису SQL
200002=Файл не існує
200003=Файл пошкоджено
200004=Помилка параметра
200026=Ім'я таблиці вже існує
200027=Ім'я таблиці не існує
200028=Помилка імпорту CSV файлу, не вдалося створити SQL, перевірте вміст CSV файлу та конфігурацію
300001=Не вибрано стовпців таблиці для створення індексу
300002=SQL-запит не може бути порожнім
300003=Аналіз SQL підтримує лише SELECT запити
[STRING]
home=Головна
database=База даних
analysis=Аналіз
view=Подання
setting=Налаштування
items=записів
tables=Таблиці
views=Подання
triggers=Тригери
columns=Стовпці
indexes=Індекси
table=Таблиця
clear-all=Очистити все
yes=Так
no=Ні
welcome-text=Ласкаво просимо до CuteSqlite
home-text1=CuteSqlite - це графічний клієнт (GUI) для Sqlite3.
home-text2=Він дозволяє проєктувати, створювати та переглядати бази даних, керувати об'єктами бази даних,
home-text3=вставляти дані, а також розробляти та виконувати SQL-запити для обробки збережених даних.
home-text4=Ви також можете перенести базу даних та дані від інших постачальників баз даних до бази даних Sqlite.
db-section-text=База даних Sqlite
analysis-text1=CuteSqlite дозволяє аналізувати та оптимізувати продуктивність SQL-запитів.
analysis-text2=А також дозволяє аналізувати об'єм сховища кожної таблиці в базі даних,
analysis-text3=а також налаштовувати параметри бази даних для її оптимізації.
perf-analysis-section-text=Аналіз продуктивності
error-text=Системна помилка:
create-database=Створити нову базу даних (Ctrl+N)
open-database=Відкрити базу даних (Ctrl+O)
refresh-database=Оновити базу даних (F5)
delete-database=Видалити вибрану БД зі списку (Del)
override-user-db=Дані видаленого файлу неможливо відновити. Підтвердити перезапис бази даних?
create-db-success-text=Базу даних успішно створено
open-db-exists-inlist=Базу даних вже відкрито, не повторюйте операцію
open-db-success-text=Базу даних успішно відкрито
delete-user-db=Підтвердити видалення бази даних "{dbName}" зі списку?
delete-db-success-text=Базу даних успішно видалено зі списку
query-editor=Редактор запитів
history=Історія
history-tip=Історія (F8)
result-list=Результати
result-info=Інформація
result-table-data=Дані таблиці
table-properties=Властивості таблиці
exec-select-sql=Виконати вибраний запит (F9)
exec-all-sql=Виконати всі запити (F10)
explain-select-sql=Пояснити (Explain) вибраний SQL-запит (F11)
explain-query-plan-sql=Пояснити план запиту (Explain query plan) вибраного SQL-запиту (F12)
query-page-help=Функція автозаповнення: [Tab]->наступна вкладка; [Ctrl+Пробіл]->показати список збігів; [Ctrl+Enter]->показати всі теги
no-select-userdb=Не вибрано базу даних
no-sql-statement=У редакторі запитів немає SQL-запиту
no-sql-content=Редактор запитів не містить SQL-запиту
show-form-view=Показати подання форми
export-result-as=Експортувати як... (Ctrl+Alt+E)
copy-result-data=Копіювати дані в буфер обміну
clear-all=Очистити все
ok=Гаразд
cancel=Скасувати
export-text-description=Виберіть формат для експорту даних
csv-settings=Параметри CSV
csv-field-settings=Стовпці
csv-line-settings=Рядки
csv-charset-settings=Кодування
excel-settings=Параметри Excel
sql-settings=Параметри SQL
export-fields-settings=Виберіть стовпці для експорту
terminated-by=Розділювач
enclosed-by=Обмежувач
escaped-by=Екрануючий символ
field-terminated-by=Розділювач стовпців
field-enclosed-by=Обмежувач стовпців
field-escaped-by=Екрануючий символ стовпців
line-terminated-by=Розділювач рядків
add-column-name=Додати назви стовпців у заголовок
csv-charset=Кодування
excel-column-max-size=Обмеження розміру текстового стовпця
excel-decinmal-places=Десяткові знаки
structure-only=Лише структура
data-only=Лише дані
structure-and-data=Структура та дані
select-all=Вибрати все
deselect-all=Зняти виділення
save-to-file=Зберегти у файл
expert-fmt-error=Будь ласка, виберіть формат файлу для експорту даних
terminated-by-error=Будь ласка, введіть значення для "Розділювач"
enclosed-by-error=Будь ласка, введіть значення для "Обмежувач"
escaped-by-error=Будь ласка, введіть значення для "Екрануючий символ"
line-terminated-by-error=Значення "Розділювач рядків" неправильне
excel-column-max-size-error=Будь ласка, введіть значення для "Обмеження розміру текстового стовпця"
excel-decinmal-places-error=Будь ласка, введіть значення для "Десяткові знаки"
export-sql-error=Будь ласка, виберіть параметри SQL
selected-fields-error=Будь ласка, виберіть поля для експорту
export-path-error=Будь ласка, вкажіть шлях до файлу експорту
sql-notsupport-multitable-query-error=Експорт результатів багатотабличних запитів та підзапитів не підтримується
export-success-text=Експорт виконано успішно, експортовано {rows} рядків даних. Відкрити файл?
open-the-file=Відкрити файл
export-file-exists-prompt={export-path} вже існує. Замінити?
limit-rows=Ліміт рядків
offset=Початковий рядок
rows=Кількість рядків
copy-all-rows-to-clipboard=Копіювати всі рядки в буфер обміну Ctrl+Alt+A
copy-sel-rows-to-clipboard=Копіювати вибрані рядки в буфер обміну Ctrl+Alt+H
copy-all-rows-as-sql=Копіювати всі рядки як SQL Ctrl+Alt+J
copy-sel-rows-as-sql=Копіювати вибрані рядки як SQL Ctrl+Alt+K
read-only=Лише читання
filter=Фільтр (Ctrl+Alt+F)
filter-in-use=Фільтр використовується
refresh=Оновити (Ctrl+F5)
refresh-page=Оновити
new-row-tip=Новий рядок (Ctrl+Alt+N)
copy-row-tip=Копіювати рядок (Ctrl+Alt+C)
save-tip=Зберегти (Ctrl+Alt+S)
delete-tip=Видалити вибрані рядки (Ctrl+Del)
cancel-tip=Скасувати зміни (Ctrl+Alt+Z)
revert-tip=Відновити
save=Зберегти
revert=Скасувати зміни
column=Назва стовпця
condition=Умова
value=Значення
delete-confirm-text=Підтвердити видалення вибраних рядків?
query=Запит
result=Результат
affected-rows=Зачеплено рядків
exec-time=Час виконання
transfer-time=Час передачі
total-time=Загальний час
database-create=Створити БД Ctrl+N
database-open=Відкрити БД Ctrl+O
database-refresh=Оновити БД Ctrl+R
database-delete=Видалити БД Del
database-copy=Копіювати БД як... Ctrl+P
database-export-as-sql=Експортувати БД у SQL Ctrl+E
database-import-from-sql=Імпортувати SQL у БД Ctrl+I
database-new=Створити
database-new-table=Таблицю
database-new-view=Подання
database-new-trigger=Тригер
export-as-sql-text-description=Експортувати вибрані таблиці/подання/тригери БД як SQL
select-database=Вибрана база даних
database-objects=Об'єкти
structure-and-data-settings=Налаштування структури та даних
insert-statement-settings=Налаштування INSERT
tbl-statement-settings=Налаштування операторів таблиці
retain-column-text=Зберігати назви стовпців в "Insert Into"
contain-multi-rows-text=Кожен оператор "Insert" містить кілька рядків (VALUES)
retain-table-text=Зберігати стару таблицю (Create Table If Not Exists ...)
override-table-text=Перезаписувати стару таблицю (DROP TABLE, потім CREATE TABLE)
import-from-sql-text-description=Пакетне виконання операторів із SQL-файлу.
abort-on-error-text=Зупинятися при помилці.
import-file-not-exists=Імпортований SQL-файл не існує, виберіть заново.
import-path-empty-error=Шлях до файлу імпорту не може бути порожнім.
import=Імпорт
export=Експорт
tbl-name=Назва таблиці
new-table=Створити таблицю
new-view=Створити подання
new-trigger=Створити тригер
database=База даних
schema=Схема
table-columns=Стовпці
table-indexes=Індекси
table-foreignkeys=Зовнішні ключі
column-name=Назва стовпця
data-type=Тип даних
default=За замовчуванням
check=Перевірка
index-name=Назва індексу
index-type=Тип індексу
index-unique=Унікальний
partial-clause=Часткова умова
comments=Коментарі
to-be-selected=Доступні поля
selected=Вибрані
up=▲
down=▼
no-columns-selected=Не вибрано стовпців, будь ласка, виберіть
sql-preview=Попередній перегляд SQL
tbl-name-empty=Назва таблиці не може бути порожньою
tbl-name-duplicated=Назва таблиці вже існує
create-table-success-text=Таблицю успішно створено.
alter-table-success-text=Таблицю успішно змінено.
rename-table-success-text=Назву таблиці успішно змінено.
delete-column-confirm-text=Вибраний стовпець використовується одним або кількома індексами. Видалення цього стовпця також змінить відповідні індекси. Підтвердити видалення?
delete-index-confirm-text=Вибраний індекс використовується одним або кількома стовпцями. Видалення цього індексу також змінить відповідні стовпці. Підтвердити видалення?
delete-confirm-text=Підтвердити видалення?
new-view=Створити подання
new-trigger=Створити тригер
create-a-view-name=Назва нового подання
view-name-not-empty=Назва нового подання не може бути порожньою
view-name-duplicated=Назва подання вже існує
create-a-trigger-name=Назва тригера
trigger-name-not-empty=Назва тригера не може бути порожньою
trigger-name-duplicated=Назва тригера вже існує
execute-sql-success=SQL успішно виконано
copy-db-success-text=Базу даних успішно скопійовано
table-open=Відкрити дані таблиці Alt+O
table-create=Створити таблицю Alt+N
table-alter=Змінити таблицю Alt+A
table-rename=Перейменувати таблицю Alt+M
table-truncate=Очистити таблицю Alt+T
table-drop=Видалити таблицю Alt+Del
table-copy-as=Копіювати таблицю в... Alt+P
table-sharding-as=Шардинг Alt+G
table-export=Експортувати таблицю в... Alt+E
table-import-sql=Імпорт із SQL файлу Alt+I
table-import-csv=Імпорт із CSV файлу Alt+J
table-manage-index=Керування індексами таблиці
table-manage-foreign-key=Керування зовнішніми ключами таблиці
properties=Властивості
primary-key-duplicated=Первинний ключ визначено повторно.
foreignkey-name=Назва зовнішнього ключа
referencing-columns=Стовпці поточної таблиці
referenced-table=Пов'язана таблиця
referenced-columns=Пов'язані стовпці
on-update=При оновленні
on-delete=При видаленні
insert-new-column=Додати новий стовпець
insert-new-index=Додати новий індекс
insert-new-foreignkey=Додати новий зовнішній ключ
insert-del-column=Видалити вибраний стовпець
insert-del-index=Видалити вибраний індекс
insert-del-foreignkey=Видалити вибраний зовнішній ключ
select-referenced-table-first=Спочатку виберіть пов'язану таблицю
new-table-name=Нова назва таблиці
table-name-not-empty=Нова назва таблиці не може бути порожньою
table-name-duplicated=Нова назва таблиці вже існує
ai-column-exists=Стовпець з AUTOINCREMENT вже існує.
ai-fobidden-multi-pk=Вже є стовпець з AUTOINCREMENT, кілька первинних ключів не дозволяються.
ai-column-must-integer=Стовпець з AUTOINCREMENT має бути типу INTEGER.
truncate-table-confirm-text=Після очищення таблиці дані неможливо відновити. Підтвердити очищення?
truncate-table-success-text=Дані таблиці успішно очищено
drop-table-confirm-text=Після видалення таблиці дані неможливо відновити. Підтвердити видалення?
drop-table-success-text=Таблицю успішно видалено
copy-table-text-description=Налаштування параметрів копіювання, підтримується шардинг таблиць
from-db-name=Вихідна БД
from-tbl-name=Вихідна таблиця
to-db-name=Цільова БД
to-tbl-name=Цільова таблиця
table-sharding-setttings=Шардинг таблиці
enable-table-sharding=Увімкнути шардинг таблиці
table-suffix-begin={suffix} Початкове ціле
table-suffix-end={suffix} Кінцеве ціле
advanced-settings=Додаткові параметри шардингу
enable-copy-data-with-strategy=Увімкнути стратегію копіювання даних у шардинговані таблиці
sharding-strategy-express-text=Вираз стратегії шардингу: {n}
preview-sql=Попередній перегляд SQL
structure-and-data-settings-unknown=Не вибрано налаштування структури та даних
table-suffix-error=Неправильне ціле для шардингу, вкажіть правильне значення
target-table-name-no-n=Цільова таблиця має містити рядок "{n}".
sharding-strategy-express-empty=Вираз стратегії шардингу не може бути порожнім
copy-table-success-text=Таблицю успішно скопійовано.
start=Старт
complete=Завершено
express-title=Вираз стратегії шардингу таблиці
functions=Функції
express-editor-help=Вираз - двічі клацніть функцію або поле, щоб вставити в редактор
import-from-csv-text-description=Налаштування для імпорту даних із CSV файлу
source-csv-file=Шлях до вихідного CSV файлу
target-database=Цільова база даних
target-table=Цільова таблиця
columns-setttings=Стовпці
csv-data=Дані CSV
column-name-on-top=Перший рядок як назви стовпців
line-terminated-by=Розділювач рядків
csv-null-as-keyword=null/NULL як ключове слово SQL
encoding=Кодування
import-success-text=Імпорт виконано успішно
incorrect-sql-statement=Неправильний SQL-запит
import-error-text=Помилка імпорту
table-manage-columns=Керування стовпцями
table-drop-column=Видалити стовпець
table-manage-indexes=Керування індексами
table-drop-index=Видалити індекс
create-view=Створити нове подання
open-view=Відкрити подання
drop-view=Видалити подання
create-trigger=Створити тригер
open-trigger=Відкрити тригер
drop-trigger=Видалити тригер
drop-view-confirm-text=Після видалення подання його неможливо відновити. Підтвердити видалення?
drop-view-success-text=Подання успішно видалено
drop-trigger-confirm-text=Після видалення тригера його неможливо відновити. Підтвердити видалення?
drop-trigger-success-text=Тригер успішно видалено
sql-templates=Шаблони SQL
pragma-templates=Pragmas
sql-log=Історія SQL
clear-all=Очистити все
use=Використовувати
explain=Пояснити
top=Закріпити
untop=Відкріпити
copy=Копіювати
delete=Видалити
today=Сьогодні
yestoday=Вчора
delete-sql-log-confirm-text=Ви впевнені, що хочете видалити історію SQL?
copy-to-clipboard=Скопійовано в буфер обміну
save-success-text=Збереження виконано успішно
delete-success-text=Видалення виконано успішно
data-has-changed=Дані було змінено. Ви впевнені, що хочете закрити сторінку?
not-save-and-close=Не зберігати, закрити
cancel=Скасувати закриття
table-export-as=Експорт таблиці Alt+E
export-as-sql-success-text=Експорт виконано успішно. Відкрити файл?
new-query=Нове вікно запиту (F7)
save-current=Зберегти поточне (Ctrl+S)
save-all=Зберегти все (Ctrl+Shift+S)
first-page=Перша сторінка
prev-page=Попередня сторінка
next-page=Наступна сторінка
last-page=Остання сторінка
save-if-data-has-changed=Дані було змінено. Зберегти перед закриттям?
unsort=Скасувати сортування
tab-close-this=Закрити цю
tab-close-others=Закрити інші
tab-close-left=Закрити всі ліворуч
tab-close-right=Закрити всі праворуч
perf-analysis=Аналіз продуктивності
perf-analysis-reports=Звіти аналізу
store-analysis=Аналіз сховища
db-params=Параметри БД
not-select-sql=Підтримуються лише SELECT запити
open-sql-log=Відкрити історію SQL для аналізу продуктивності (Ctrl+L)
add-sql-analysis=Введіть SQL-запит для аналізу продуктивності (Ctrl+I)
sql-log-not-found=Історію SQL не знайдено, перевірте, чи не було її видалено
original-sql=Оригінальний SQL-запит
where-clause-analysis=Аналіз умови WHERE
order-clause-analysis=Аналіз умови ORDER
covering-index-analysis=Аналіз покриваючих індексів
table-join-analysis=Аналіз JOIN
in-table=Таблиця даних
where-use-column=Умова WHERE використовує стовпці
order-use-column=Умова ORDER використовує стовпці
covering-index-column=Умови WHERE та ORDER використовують стовпці
where-use-index=Умова WHERE використовує індекс
order-use-index=Умова ORDER використовує індекс
use-covering-index=Використовується покриваючий індекс
create-index-for-performance=Рекомендація: створіть індекс для наступних полів, щоб підвищити продуктивність запитів
hint-index-for-performance=Підказка: індекс {hintIndexName} вже покриває поля: {hintIndexColumns}
create-covering-index-for-performance=Рекомендація: створіть покриваючий індекс для наступних полів, щоб підвищити продуктивність запитів
create-index-togeger=Створити індекс (разом)
create-index-individ=Створити індекси (окремо)
create-covering-index=Створити покриваючий індекс
explain-query-plan=Пояснити план запиту
query-optimizer-pseudocode=Псевдокод нижче показує процес виконання оптимізатора запитів
cycle-count=Статистика циклів
optimize-cycle-count=Підказка: зміна порядку з'єднання таблиць JOIN може оптимізувати та зменшити кількість циклів.
general-settings=Загальні налаштування
about=Про програму
language-setting=Налаштування мови інтерфейсу
change-language-restart-text=Для зміни мови необхідно перезапустити програму.
close-and-restart=Закрити та перезапустити
do-not-restart=Не перезапускати
about-us=Про нас
about-us-description=CuteSqlite - це програмне забезпечення з відкритим кодом, розроблене Xuehan Qin.
version-info=Версія
version-info-description=CuteSqlite v0.2.2 beta (64-розрядна)
feedback=Зворотний зв'язок
feedback-description=Якщо у вас виникли проблеми з програмним забезпеченням, або є ідеї та пропозиції щодо цього додатку, будь ласка, заповніть форму нижче, щоб надіслати нам відгук.
content-text=Зміст
license=Ліцензія Apache версії 2.0
select-columns-analysis=Аналіз полів SELECT
select-use-column=Оператор SELECT використовує наступні поля
select-use-column-count=Кількість полів
select-use-column-advice=Рекомендація: оператор SELECT вибирає більше {maxColumns} полів. Зменшення кількості полів може підвищити продуктивність запитів.
select-use-column-tips=Підказка: зменшення кількості полів може підвищити продуктивність запитів.
sql-perf-report-prefix=звіт-продуктивності-sql-
store-analysis-prefix=Аналіз сховища:
analysis-sql=Аналіз SQL
open-perf-report=Відкрити звіт Alt+O
drop-perf-report=Видалити звіт Alt+Del
drop-perf-report-confirm-text=Підтвердити видалення звіту?
store-analysis-text=Дозволяє аналізувати об'єм сховища, який займає база даних, таблиці та індекси
table-store-analysis=Таблиця - {tblName}
index-store-analysis=Індекс - {idxName} - Таблиця: {tblName}
db-disk-used-title=Звіт про використання дискового простору, шлях до БД: {dbPath}
page-size-text=Розмір сторінки (байт)
page-size-tips=Розмір сторінки (байт)
file-bytes-text=Розмір файлу (байт)
file-bytes-tips=Розмір файлу (байт)
file-pgcnt-text=Кількість сторінок у всьому файлі (виміряна)
file-pgcnt-tips=Кількість сторінок у всьому файлі (виміряна)
file-pgcnt2-text=Кількість сторінок у всьому файлі (обчислена)
file-pgcnt2-tips=Кількість сторінок у всьому файлі (обчислена)
inuse-pgcnt-text=Кількість сторінок з даними (використовуваних)
inuse-pgcnt-tips=Кількість сторінок з даними (використовуваних)
free-pgcnt2-text=Кількість сторінок без даних (за заголовком)
free-pgcnt2-tips=Кількість сторінок без даних (за заголовком)
free-pgcnt-text=Кількість сторінок без даних (обчислена)
free-pgcnt-tips=Кількість сторінок без даних (обчислена)
av-pgcnt-text=Кількість автоматично очищених сторінок
av-pgcnt-tips=Кількість автоматично очищених сторінок
ntable-text=Кількість таблиць у БД
ntable-tips=Кількість таблиць у БД
nindex-text=Кількість індексів
nindex-tips=Кількість індексів
nmanindex-text=Кількість визначених індексів
nmanindex-tips=Кількість визначених індексів
nautoindex-text=Кількість неявних індексів (автоінкремент)
nautoindex-tips=Кількість неявних індексів (автоінкремент)
user-payload-text=Байт, зайнятих корисним навантаженням користувача
user-payload-tips=Байт, зайнятих корисним навантаженням користувача
all-tbl-entrycnt-title=Загальна кількість записів у всіх таблицях
all-tbl-idx-pagecnt-title=Кількість сторінок усіх таблиць та їх індексів
sperate-tbl-idx-pagecnt-title=Кількість сторінок усіх таблиць та індексів (окремо)
all-tbl-idx-report-title=Усі таблиці та індекси
total-pages-percent-text=Відсоток від загальної кількості сторінок БД
total-pages-percent-tips=Відсоток від загальної кількості сторінок БД
nentry-text=Кількість записів
nentry-tips=Кількість записів
storage-text=Використовуваний об'єм пам'яті (байт)
storage-tips=Використовуваний об'єм пам'яті (байт)
compressed-size-text=Використовуваний об'єм після стиснення (байт)
compressed-size-tips=Використовуваний об'єм після стиснення (байт)
payload-text=Об'єм корисного навантаження (байт)
payload-tips=Об'єм корисного навантаження (байт)
total-meta-text=Об'єм метаданих (байт)
total-meta-tips=Об'єм метаданих (байт)
depth-text=Глибина B-дерева
depth-tips=Глибина B-дерева
avg-payload-text=Середнє корисне навантаження на запис
avg-payload-tips=Середнє корисне навантаження на запис
avg-unused-text=Середня кількість невикористовуваних байт на запис
avg-unused-tips=Середня кількість невикористовуваних байт на запис
avg-meta-text=Середній об'єм метаданих на запис
avg-meta-tips=Середній об'єм метаданих на запис
avg-fanout-text=Середній коефіцієнт розгалуження
avg-fanout-tips=Середній коефіцієнт розгалуження
gap-cnt-text=Незміжні сторінки
gap-cnt-tips=Незміжні сторінки
mx-payload-text=Максимальне корисне навантаження на запис
mx-payload-tips=Максимальне корисне навантаження на запис
ovfl-cnt-text=Кількість використаних переповнених записів
ovfl-cnt-tips=Кількість використаних переповнених записів
int-pages-text=Кількість використаних сторінок індексів
int-pages-tips=Кількість використаних сторінок індексів
leaf-pages-text=Кількість використаних листових сторінок
leaf-pages-tips=Кількість використаних листових сторінок
ovfl-pages-text=Кількість використаних сторінок переповнення
ovfl-pages-tips=Кількість використаних сторінок переповнення
total-pages-text=Загальна кількість використаних сторінок
total-pages-tips=Загальна кількість використаних сторінок
int-unused-text=Невикористовувані байти на сторінках індексів
int-unused-tips=Невикористовувані байти на сторінках індексів
leaf-unused-text=Невикористовувані байти на листових сторінках
leaf-unused-tips=Невикористовувані байти на листових сторінках
ovfl-unused-text=Невикористовувані байти на сторінках переповнення
ovfl-unused-tips=Невикористовувані байти на сторінках переповнення
total-unused-text=Невикористовувані байти на всіх сторінках
total-unused-tips=Невикористовувані байти на всіх сторінках
all-table-report-title=Усі таблиці (без індексів)
all-indices-report-title=Усі індекси (без таблиць)
tbl-and-all-idx-report-title=Таблиця {tblName} та всі її індекси
tbl-only-report-title=Таблиця {tblName} (без індексів)
idx-only-report-title=Всі індекси таблиці {tblName}
tbl-report-title=Таблиця {tblName}
idx-report-title=Індекс {idxName} таблиці {tblName}
props-tbl-only-report-title=Аналіз сховища таблиці {tblName}
props-idx-props-only-report-title=Всі індекси таблиці {tblName}
db-pragma-params=Параметри PRAGMA
db-quick-config-params=Швидкі налаштування
select-pragma=PRAGMA
pragma-analysis-limit-tips=Запит або зміна обмежень для налаштувань аналізу (ANALYZE). Це приблизна кількість рядків, яку команда ANALYZE перевіряє в кожному індексі.
pragma-application-id-tips=Використовується для запиту або встановлення 32-бітного знакового цілого числа "Application ID" з порядком байт big-endian, розташованого за зміщенням 68 у заголовку бази даних.
pragma-auto-vacuum-tips=Запит або встановлення статусу автоматичного очищення (auto-vacuum) у базі даних.
pragma-automatic-index-tips=Запит, встановлення або вимкнення функції автоматичного індексування.
pragma-busy-timeout-tips=Запит або зміна налаштування тайм-ауту очікування (busy timeout).
pragma-cache-size-tips=Запит або зміна максимальної кількості сторінок диска бази даних, яку SQLite рекомендує зберігати в пам'яті для кожного відкритого файлу бази даних.
pragma-cache-spill-tips=Увімкнення або вимкнення можливості програми підкачки скидати "брудні" сторінки кешу у файл бази даних під час транзакції.
pragma-case-sensitive-like-tips=Поведінка оператора LIKE за замовчуванням ігнорує регістр символів ASCII. Таким чином, за замовчуванням 'a' LIKE 'A' істинно.
pragma-cell-size-check-tips=Увімкнення або вимкнення додаткових перевірок цілісності під час читання сторінок B-дерева бази даних з диска. Якщо перевірку розміру комірки ввімкнено, пошкодження бази даних може бути виявлено раніше та з меншою ймовірністю "пошириться".
pragma-checkpoint-fullfsync-tips=Запит або зміна прапорця fullfsync для операцій контрольної точки (checkpoint). Якщо цей прапорець встановлено, метод синхронізації F_FULLFSYNC буде використовуватися під час операцій контрольної точки в системах, що підтримують F_FULLFSYNC. Значення прапорця CHECKPOINT_FULLFSYNC за замовчуванням - OFF. Тільки Mac OS-X підтримує F_FULLFSYNC.
pragma-collation-list-tips=Повертає список послідовностей сортування (collation), визначених для поточного підключення до бази даних.
pragma-compile-options-tips=Повертає назви параметрів компіляції, використаних під час збирання SQLite, по одному параметру на рядок.
pragma-count-changes-tips=Запит або зміна прапорця підрахунку змін (count changes). Зазвичай, коли прапорець count-changes не встановлено, оператори INSERT, UPDATE та DELETE не повертають дані.
pragma-data-store-directory-tips=Запит або зміна значення глобальної змінної sqlite3_data_directory, що використовується внутрішнім інтерфейсом Windows для визначення розташування файлів бази даних, вказаних з відносним шляхом.
pragma-data-version-tips=Вказує, що файл бази даних було змінено. Інтерактивні програми, що зберігають вміст бази даних у пам'яті або відображають його на екрані, можуть використовувати команду PRAGMA data_version для визначення необхідності оновлення кешу або екрана.
pragma-default-cache-size-tips=Запит або встановлення рекомендованої максимальної кількості сторінок дискового кешу, що виділяються для кожного відкритого файлу бази даних.
pragma-defer-foreign-keys-tips=Вказує відкласти перевірку всіх обмежень зовнішнього ключа до моменту фіксації найбільш зовнішньої транзакції.
pragma-empty-result-callbacks-tips=Запит або зміна прапорця зворотного виклику для порожнього результату.
pragma-encoding-tips=Текстове кодування, яке використовується основною базою даних: 'UTF-8', 'UTF-16le' (little-endian UTF-16) або 'UTF-16be' (big-endian UTF-16).
pragma-foreign-key-check-tips=Перевіряє базу даних або таблицю на наявність порушень обмежень зовнішнього ключа.
pragma-foreign-keys-tips=Запит, встановлення або вимкнення примусового дотримання обмежень зовнішнього ключа.
pragma-freelist-count-tips=Повертає кількість невикористовуваних сторінок у файлі бази даних.
pragma-full-column-names-tips=Запит або зміна прапорця full_column_names.
pragma-fullfsync-tips=Запит або зміна прапорця fullfsync. Цей прапорець визначає, чи буде використовуватися метод синхронізації F_FULLFSYNC у системах, які його підтримують. Значення fullfsync за замовчуванням - OFF. Тільки Mac OS X підтримує F_FULLFSYNC.
pragma-hard-heap-limit-tips=Встановлює обмеження на обсяг пам'яті купи (heap) для всіх підключень до бази даних в одному процесі.
pragma-ignore-check-constraints-tips=Увімкнення або вимкнення примусового дотримання обмежень CHECK. Значення за замовчуванням - OFF, що означає, що обмеження CHECK застосовуються за замовчуванням.
pragma-incremental-vacuum-tips=Викликає видалення до N сторінок зі списку вільних сторінок (freelist).
pragma-integrity-check-tips=Виконує низькорівневу перевірку форматування та цілісності бази даних.
pragma-journal-mode-tips=Запит або встановлення режиму журналу (journal mode) для бази даних, пов'язаної з поточним підключенням.
pragma-journal-size-limit-tips=Обмежує розмір файлів журналу відкату (rollback journal) та WAL, що залишаються у файловій системі після транзакції або контрольної точки.
pragma-legacy-alter-table-tips=Встановлює або запитує значення прапорця legacy_alter_table.
pragma-locking-mode-tips=Встановлює або запитує режим блокування (locking mode) підключення до бази даних. Режими: NORMAL або EXCLUSIVE.
pragma-max-page-count-tips=Запит або встановлення максимальної кількості сторінок у файлі бази даних.
pragma-mmap-size-tips=Запит або зміна максимальної кількості байт, зарезервованих для введення-виведення з відображенням у пам'ять (memory-mapped I/O) для однієї бази даних.
pragma-module-list-tips=Повертає список модулів віртуальних таблиць, зареєстрованих у підключенні до бази даних.
pragma-optimize-tips=Намагається оптимізувати базу даних.
pragma-page-count-tips=Повертає загальну кількість сторінок у файлі бази даних.
pragma-page-size-tips=Запит або встановлення розміру сторінки бази даних. Розмір сторінки має бути степенем двійки від 512 до 65536.
pragma-parser-trace-tips=Увімкнення трасування синтаксичного аналізатора SQL, що використовується всередині SQLite. Працює лише при компіляції з SQLITE_DEBUG.
pragma-query-only-tips=Забороняє зміну даних у файлі бази даних. Якщо цю опцію ввімкнено, будь-яка спроба CREATE, UPDATE, DROP, INSERT або UPDATE призведе до помилки SQLITE_READONLY.
pragma-quick-check-tips=Виконує низькорівневу перевірку форматування та цілісності бази даних, пропускаючи перевірки цілісності UNIQUE та індексів.
pragma-read-uncommitted-tips=Запит, встановлення або вимкнення рівня ізоляції READ UNCOMMITTED.
pragma-recursive-triggers-tips=Запит, встановлення або вимкнення рекурсивного виконання тригерів.
pragma-reverse-unordered-selects-tips=Якщо цю прагму ввімкнено, багато SELECT запитів без ORDER BY повертатимуть результати у зворотному до звичайного порядку.
pragma-schema-version-tips=Отримує або встановлює ціле число schema_version за зміщенням 40 у заголовку бази даних.
pragma-secure-delete-tips=Запит або зміна налаштування безпечного видалення (secure-delete).
pragma-short-column-names-tips=Запит або зміна прапорця коротких назв стовпців.
pragma-soft-heap-limit-tips=Обмежує обсяг пам'яті купи, що використовується всіма підключеннями до бази даних в одному процесі.
pragma-stats-tips=Повертає допоміжну інформацію про таблиці та індекси.
pragma-synchronous-tips=Запит або зміна налаштування прапорця "synchronous".
pragma-temp-store-tips=Запит або зміна значення глобальної змінної sqlite3_temp_directory, що використовується багатьма внутрішніми інтерфейсами ОС для визначення місця зберігання тимчасових таблиць та індексів.
pragma-threads-tips=Кількість допоміжних потоків, що запускаються підготовленим запитом (prepared statement) для допомоги у виконанні.
pragma-trusted-schema-tips=Чи дозволено виконання небезпечних SQL-функцій та віртуальних таблиць у схемі. Визначає, чи можуть подання, тригери або вирази схеми (наприклад, обмеження CHECK, пропозиції DEFAULT, генеровані стовпці, індекси на виразах та/або часткові індекси) виконувати неперевірені на безпеку SQL-функції та віртуальні таблиці.
pragma-user-version-tips=Отримує або встановлює ціле число user_version за зміщенням 60 у заголовку бази даних.
pragma-vdbe-addoptrace-tips=Повні коди операцій VDBE відображаються в процесі генерації коду. Працює, якщо SQLite скомпільовано з опцією SQLITE_DEBUG та ввімкнено vdbe_debug.
pragma-vdbe-debug-tips=Увімкнення налагодження VDBE. Працює, якщо SQLite скомпільовано з опцією SQLITE_DEBUG.
pragma-vdbe-listing-tips=Виводить повний список кодів операцій віртуальної машини на стандартний вивід. Працює, якщо SQLite скомпільовано з опцією SQLITE_DEBUG та ввімкнено vdbe_debug.
pragma-vdbe-trace-tips=Виводить коди операцій віртуальної машини на стандартний вивід під час обчислень. Працює, якщо SQLite скомпільовано з опцією SQLITE_DEBUG та ввімкнено vdbe_debug.
pragma-wal-autocheckpoint-tips=Запит або встановлення інтервалу автоматичної контрольної точки (auto-checkpoint) для журналу попереднього запису (write-ahead log).
pragma-wal-checkpoint-tips=Викликає перенесення вмісту журналу попереднього запису (write-ahead log) для бази даних X у підключенні D у файл бази даних та скидання журналу попереднього запису.
pragma-writable-schema-tips=Дозволяє змінювати таблицю sqlite_schema за допомогою звичайних операторів UPDATE, INSERT та DELETE. Попередження: неправильне використання цієї прагми може легко призвести до пошкодження файлу бази даних.
pragma-save-confirm=Оператор PRAGMA вплине на роботу бази даних. Підтвердити виконання наступного оператора?
confirm-exec-text=Підтвердити та виконати